import React from 'react';
import './privacy.css';
import Header from '../components/header/Header';
import Footer from '../components/footer/Footer';

const PrivacyPolicy = () => {
    return (
        <div className="privacy-container">
            <Header/>
            <div className="privacy-content">
                <h1>Политика конфиденциальности ООО Перевозки</h1>
                <p>Ваша конфиденциальность важна для нас. Эта политика конфиденциальности объясняет, какие персональные
                    данные мы собираем, как мы их используем и ваши права в отношении ваших данных.</p>

                <h2>Сбор информации</h2>
                <p>Мы собираем информацию, чтобы предоставлять лучшие услуги нашим пользователям. Это включает:</p>
                <ul>
                    <li>Персональные данные (имя, адрес электронной почты, номер телефона и т.д.)</li>
                    <li>Данные об использовании (посещенные страницы, время, проведенное на страницах и т.д.)</li>
                    <li>Данные о местоположении (если вы разрешаете нам их собирать)</li>
                </ul>

                <h2>Использование информации</h2>
                <p>Мы используем собранную информацию для:</p>
                <ul>
                    <li>Предоставления, эксплуатации и поддержания наших услуг</li>
                    <li>Улучшения, персонализации и расширения наших услуг</li>
                    <li>Понимания и анализа того, как вы используете наши услуги</li>
                    <li>Разработки новых продуктов, услуг, функций и функциональности</li>
                    <li>Связи с вами, как напрямую, так и через одного из наших партнеров, включая обслуживание
                        клиентов, предоставление обновлений и другой информации, связанной с услугой, а также для
                        маркетинговых и рекламных целей
                    </li>
                    <li>Обработки ваших транзакций и управления вашими заказами</li>
                    <li>Отправки вам электронных писем</li>
                    <li>Обнаружения и предотвращения мошенничества</li>
                </ul>

                <h2>Передача и раскрытие данных</h2>
                <p>Мы не передаем ваши персональные данные третьим лицам, за исключением следующих случаев:</p>
                <ul>
                    <li>С вашего согласия</li>
                    <li>Для внешней обработки доверенными партнерами, которые соблюдают наши политики защиты данных</li>
                    <li>По юридическим причинам, таким как соблюдение применимых законов и нормативных актов</li>
                </ul>

                <h2>Безопасность данных</h2>
                <p>Мы внедряем различные меры безопасности для защиты ваших персональных данных. Однако ни один метод
                    передачи данных через Интернет или метод электронного хранения не является на 100% безопасным, и мы
                    не можем гарантировать абсолютную безопасность.</p>

                <h2>Ваши права на защиту данных</h2>
                <p>Вы имеете право:</p>
                <ul>
                    <li>Доступ – Вы имеете право запросить копии ваших персональных данных.</li>
                    <li>Исправление – Вы имеете право запросить исправление любой информации, которую вы считаете
                        неточной, или дополнение информации, которую вы считаете неполной.
                    </li>
                    <li>Удаление – Вы имеете право запросить удаление ваших персональных данных при определенных
                        условиях.
                    </li>
                    <li>Ограничение обработки – Вы имеете право запросить ограничение обработки ваших персональных
                        данных при определенных условиях.
                    </li>
                    <li>Возражение против обработки – Вы имеете право возражать против обработки ваших персональных
                        данных при определенных условиях.
                    </li>
                    <li>Переносимость данных – Вы имеете право запросить передачу данных, которые мы собрали, другой
                        организации или непосредственно вам при определенных условиях.
                    </li>
                </ul>

                <h2>Свяжитесь с нами</h2>
                <p>Если у вас есть вопросы по поводу этой политики конфиденциальности, пожалуйста, свяжитесь с нами по
                    адресу privacy@example.com.</p>
            </div>
            <Footer/>
        </div>
    );
};

export default PrivacyPolicy;